# data-database-types-relational-language-SQL-MySQL-function-stored-routine-CREATE-FUNCTION
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- **mysql** - **statements** - can **run** **over** **many** **lines** - **semi-colon** - will **terminate** **statement** [1]

- **run** - **function** - **include** a **semi-colon** - **change** **delimiter** [1]

- when **mysql** **encounters** the **delimiter** - // - **executes** - **runs** **statement** - do not forget to change delimiter back to the semi-colon [1]

```sql
delimiter //
```

- define - stored function - arguments - accepted - two integers [1]

```sql
CREATE FUNCTION AddTwoNumbers
```

- parameters - two integers - num1 - num2 [1]

```sql
CREATE FUNCTION AddTwoNumbers(num1 integer,num2 integer)
```

- function **always** - **RETURNS** - a **value** - **specify** - **data** **type** - integer [1]

```sql
CREATE FUNCTION AddTwoNumbers(num1 integer,num2 integer)
RETURNS integer
```

- **specify** **characteristics** of the function - either - **deterministic** or **non-deterministic** [1]

 - **non-deterministic** function **modifies** the **data** - have **statements** - **UPDATE** - **DELETE** - **INSERT** [1]

```sql
CREATE FUNCTION AddTwoNumbers(num1 integer,num2 integer)
RETURNS integer
DETERMINISTIC
```

- actual **code** is **written** between **statements** - **BEGIN** - **END** [1]

```sql
CREATE FUNCTION AddTwoNumbers(num1 integer,num2 integer)
RETURNS integer
DETERMINISTIC
BEGIN
END
```

- function - **RETURN** - an integer - **result** [1]

```sql
CREATE FUNCTION AddTwoNumbers(num1 integer,num2 integer)
RETURNS integer
DETERMINISTIC
BEGIN
    RETURN num1+num2;
END
```

- **change** **delimiter** back to **default** **semi-colon** [1]

```sql
delimiter ;
```

```sql
mysql> delimiter //
mysql> CREATE FUNCTION AddTwoNumbers(num1 integer,num2 integer)
    -> RETURNS integer
    -> DETERMINISTIC
    -> BEGIN
    ->   RETURN num1+num2;
    -> END
    -> //
Query OK, 0 rows affected (0.03 sec)
```

- stored function - AddTwoNumbers - re-written [1]

```sql
mysql> delimiter //
mysql> CREATE FUNCTION AddTwoNumbers(num1 INTEGER,num2 INTEGER)
    -> RETURNS INTEGER
    -> DETERMINISTIC
    -> BEGIN
    ->   RETURN num1+num2;
    -> END
    ->
    -> //
Query OK, 0 rows affected (0.01 sec)
```

```sql
mysql> delimiter ;
mysql> SELECT AddTwoNumbers(2,3);
+--------------------+
| AddTwoNumbers(2,3) |
+--------------------+
|                  5 |
+--------------------+
1 row in set (0.00 sec)
```

```sql
mysql> use lab1;
Database changed
```

```sql
mysql> show tables;
+----------------+
| Tables_in_lab1 |
+----------------+
| car            |
| person         |
| personex       |
+----------------+
3 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+-------+------+------+------------+-----------+
| personID | name  | age  | sex  | dob        | isStudent |
+----------+-------+------+------+------------+-----------+
|        1 | John  |   23 | M    | 2000-01-01 |         1 |
|        2 | Tom   |   64 | M    | 1958-03-11 |         0 |
|        3 | Mary  |   12 | F    | 2005-04-11 |         1 |
|        4 | Alan  |   12 | M    | 2005-11-21 |         1 |
|        5 | Pat   |   29 | M    | 1993-03-17 |         0 |
|        6 | Shane |   40 | M    | 1988-07-21 |         0 |
|        7 | Shane |   14 | M    | 2003-06-01 |         1 |
|        8 | Alice |   24 | F    | 1999-03-01 |         1 |
|        9 | Pat   |   37 | F    | 1988-04-15 |         0 |
+----------+-------+------+------+------------+-----------+
9 rows in set (0.00 sec)
```

```sql
mysql> DESCRIBE person;
+-----------+---------------+------+-----+---------+----------------+
| Field     | Type          | Null | Key | Default | Extra          |
+-----------+---------------+------+-----+---------+----------------+
| personID  | int           | NO   | PRI | NULL    | auto_increment |
| name      | varchar(20)   | NO   |     | NULL    |                |
| age       | int           | YES  |     | NULL    |                |
| sex       | enum('M','F') | YES  |     | M       |                |
| dob       | date          | YES  |     | NULL    |                |
| isStudent | tinyint(1)    | YES  |     | NULL    |                |
+-----------+---------------+------+-----+---------+----------------+
6 rows in set (0.00 sec)
```

- **stored** **function** - **Discount** - accepts one parameter - age - data type - INT(11) - apply a discount based on argument passed [1] 

```sql
CREATE FUNCTION Discount(age INT(11))
```

- returns a string of three characters [1]

```sql
RETURNS VARCHAR(3)
```

- does not modify data [1]

```sql
DETERMINISTIC
```

```sql
mysql> delimiter //
mysql> CREATE FUNCTION Discount(age INT(11))
    -> RETURNS VARCHAR(3)
    -> DETERMINISTIC
    -> BEGIN
    ->   IF age<16 THEN
    ->     RETURN "0%";
    ->   ELSEIF age<26 THEN
    ->     RETURN "10%";
    ->   ELSEIF age<40 THEN
    ->     RETURN "20%";
    ->   ELSEIF age<60 THEN
    ->     RETURN "30%";
    ->   ELSE
    ->     RETURN "40%";
    ->   END IF;
    -> END
    -> //
Query OK, 0 rows affected, 1 warning (0.01 sec)
```

```sql
mysql> delimiter ;
mysql> SELECT Discount(15);
+--------------+
| Discount(15) |
+--------------+
| 0%           |
+--------------+
1 row in set (0.00 sec)

mysql> SELECT Discount(25);
+--------------+
| Discount(25) |
+--------------+
| 10%          |
+--------------+
1 row in set (0.00 sec)

mysql> SELECT Discount(39);
+--------------+
| Discount(39) |
+--------------+
| 20%          |
+--------------+
1 row in set (0.00 sec)

mysql> SELECT Discount(59);
+--------------+
| Discount(59) |
+--------------+
| 30%          |
+--------------+
1 row in set (0.00 sec)

mysql> SELECT Discount(60);
+--------------+
| Discount(60) |
+--------------+
| 40%          |
+--------------+
1 row in set (0.00 sec)
```

- apply to the column - attribute - field - age - in the table - entity - relation - person - stored function - Discount - accepts as an argument the column - attribute - field - age - for each row - record - field [1]

```sql
mysql> SELECT name,age,Discount(age) as "Discount"
    -> FROM person;
+-------+------+----------+
| name  | age  | Discount |
+-------+------+----------+
| John  |   23 | 10%      |
| Tom   |   64 | 40%      |
| Mary  |   12 | 0%       |
| Alan  |   12 | 0%       |
| Pat   |   29 | 20%      |
| Shane |   40 | 30%      |
| Shane |   14 | 0%       |
| Alice |   24 | 10%      |
| Pat   |   37 | 20%      |
+-------+------+----------+
9 rows in set (0.00 sec)
```

```sql
mysql> SHOW FUNCTION STATUS
    -> WHERE db="lab1";
+------+---------------+----------+----------------+---------------------+---------------------+---------------+---------+----------------------+----------------------+--------------------+
| Db   | Name          | Type     | Definer        | Modified            | Created             | Security_type | Comment | character_set_client | collation_connection | Database Collation |
+------+---------------+----------+----------------+---------------------+---------------------+---------------+---------+----------------------+----------------------+--------------------+
| lab1 | AddTwoNumbers | FUNCTION | root@localhost | 2020-07-11 14:55:32 | 2020-07-11 14:55:32 | DEFINER       |         | cp850                | cp850_general_ci     | utf8mb4_0900_ai_ci |
| lab1 | Discount      | FUNCTION | root@localhost | 2020-07-11 14:35:22 | 2020-07-11 14:35:22 | DEFINER       |         | cp850                | cp850_general_ci     | utf8mb4_0900_ai_ci |
+------+---------------+----------+----------------+---------------------+---------------------+---------------+---------+----------------------+----------------------+--------------------+
2 rows in set (0.00 sec)
```

```sql
mysql> DROP FUNCTION AddTwoNumbers;
Query OK, 0 rows affected (0.01 sec)

mysql> DROP FUNCTION Discount;
Query OK, 0 rows affected (0.01 sec)

mysql> SHOW FUNCTION STATUS
    -> WHERE db="lab1";
Empty set (0.00 sec)
```

***
# END